single batch size: 60 
batch size: 15 
epochs: 30 
split point: 0.8 
training loss: [0.015503963455557823, 0.017969250679016113, 0.021095767617225647, 0.026228951290249825, 0.013593059033155441, 0.008148725144565105, 0.006268119439482689, 0.005553612485527992, 0.006289458833634853, 0.006029503419995308, 0.005338895134627819, 0.005043197423219681, 0.004895377438515425, 0.004932798445224762, 0.005384048447012901, 0.005128358956426382, 0.0040061320178210735, 0.0037332396022975445, 0.004220667760819197, 0.0041436487808823586, 0.003550319466739893, 0.004536279942840338, 0.004969384055584669, 0.0038085742853581905, 0.0034448960795998573, 0.003410890931263566, 0.003486597677692771, 0.003024169011041522, 0.002932874485850334, 0.0031172516755759716] 
lowest training loss: 0.002932874485850334  
last training loss: 0.0031172516755759716  
validation loss: [0.009056441485881805, 0.01005414966493845, 0.02975495532155037, 0.017568444833159447, 0.009477627463638783, 0.005664296913892031, 0.0041129933670163155, 0.006097473204135895, 0.005800248589366674, 0.004591119475662708, 0.007922635413706303, 0.0034756457898765802, 0.005359498783946037, 0.003107474884018302, 0.008467009291052818, 0.006115068681538105, 0.005283589009195566, 0.003332675900310278, 0.00974702462553978, 0.002479946007952094, 0.0025962188374251127, 0.0028563442174345255, 0.006413981784135103, 0.003391360631212592, 0.0028173578903079033, 0.0035986092407256365, 0.004110140260308981, 0.002880268730223179, 0.0026340933982282877, 0.0023628431372344494] 
lowest validation loss: 0.0023628431372344494  
last validation loss: 0.0023628431372344494  
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 60, 32)            4352      
_________________________________________________________________
dropout (Dropout)            (None, 60, 32)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 60, 32)            8320      
_________________________________________________________________
dropout_1 (Dropout)          (None, 60, 32)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 32)                8320      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 33        
=================================================================
Total params: 21,025
Trainable params: 21,025
Non-trainable params: 0
_________________________________________________________________
