single batch size: 60 
batch size: 15 
epochs: 30 
split point: 0.8 
training loss: [0.07489398866891861, 0.03143862262368202, 0.03190307691693306, 0.034756407141685486, 0.03684467449784279, 0.037363357841968536, 0.03167346119880676, 0.030873941257596016, 0.022403156384825706, 0.01752292364835739, 0.014092676341533661, 0.014412317425012589, 0.01341860182583332, 0.011801720596849918, 0.012639094144105911, 0.010782113298773766, 0.00914391502737999, 0.009161158464848995, 0.010020320303738117, 0.011007007211446762, 0.010156188160181046, 0.010568158701062202, 0.010045360773801804, 0.007804455701261759, 0.008093473501503468, 0.008602377958595753, 0.007989788427948952, 0.0075744264759123325, 0.00710786459967494, 0.0072763292118906975] 
lowest training loss: 0.00710786459967494  
last training loss: 0.0072763292118906975  
validation loss: [0.0009619233314879239, 0.0009529160452075303, 0.001121906447224319, 0.0009820314589887857, 0.0009589199326001108, 0.0008771806606091559, 0.0007800242747180164, 0.0006781023112125695, 0.0005563123268075287, 0.000536152278073132, 0.0005516438977792859, 0.0005985464085824788, 0.0005618805298581719, 0.000573713390622288, 0.0005808208370581269, 0.0005484067369252443, 0.0007186184520833194, 0.0005741810891777277, 0.000514419109094888, 0.000600209750700742, 0.0005904383142478764, 0.0005445179413072765, 0.0005999675486236811, 0.00067723891697824, 0.0006208905833773315, 0.0006618367624469101, 0.000598864397034049, 0.0006654562894254923, 0.000604008324444294, 0.0008118947735056281] 
lowest validation loss: 0.000514419109094888  
last validation loss: 0.0008118947735056281  
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 60, 32)            4352      
_________________________________________________________________
dropout (Dropout)            (None, 60, 32)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 60, 32)            8320      
_________________________________________________________________
dropout_1 (Dropout)          (None, 60, 32)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 32)                8320      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 33        
=================================================================
Total params: 21,025
Trainable params: 21,025
Non-trainable params: 0
_________________________________________________________________
