single batch size: 30 
batch size: 32 
epochs: 30 
split point: 0.8 
training loss: [0.07314037531614304, 0.051305126398801804, 0.037748783826828, 0.024503853172063828, 0.02159271389245987, 0.016759881749749184, 0.016262561082839966, 0.015507644042372704, 0.016167903319001198, 0.015306083485484123, 0.014336273074150085, 0.013578416779637337, 0.014342498034238815, 0.013599393889307976, 0.013268706388771534, 0.01139526441693306, 0.012440512888133526, 0.01085979025810957, 0.009853056631982327, 0.010541300289332867, 0.010507859289646149, 0.01096126064658165, 0.01060610730201006, 0.010377146303653717, 0.009376891888678074, 0.00962541438639164, 0.010207273997366428, 0.010609650984406471, 0.01033924613147974, 0.008800600655376911] 
lowest training loss: 0.008800600655376911  
last training loss: 0.008800600655376911  
validation loss: [0.0029172454960644245, 0.009610706008970737, 0.004068741109222174, 0.0025385243352502584, 0.001556398463435471, 0.0011309979017823935, 0.0009151426493190229, 0.0009606237872503698, 0.0014394574100151658, 0.0008608982316218317, 0.0014377660118043423, 0.0008645777706988156, 0.0009140634792856872, 0.0010107073467224836, 0.0007948335842229426, 0.0011306669330224395, 0.001053313259035349, 0.0011132416548207402, 0.0007824436179362237, 0.0008637646096758544, 0.0012564387870952487, 0.0007964042015373707, 0.0009555562864989042, 0.000808277225587517, 0.0007032286957837641, 0.0006891453522257507, 0.0007563803228549659, 0.0009427581680938601, 0.0008730787667445838, 0.0006708562141284347] 
lowest training loss: 0.0006708562141284347  
last training loss: 0.0006708562141284347  
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 30, 32)            4352      
_________________________________________________________________
dropout (Dropout)            (None, 30, 32)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 8)                 1312      
_________________________________________________________________
dropout_1 (Dropout)          (None, 8)                 0         
_________________________________________________________________
dense (Dense)                (None, 1)                 9         
=================================================================
Total params: 5,673
Trainable params: 5,673
Non-trainable params: 0
_________________________________________________________________
