single batch size: 30 
batch size: 32 
epochs: 30 
split point: 0.8 
training loss: [0.0003883392782881856, 0.0013084560632705688, 0.0017635623225942254, 0.0018883938901126385, 0.002038236940279603, 0.0019810812082141638, 0.001822359161451459, 0.0019016670994460583, 0.0015709639992564917, 0.0011342738289386034, 0.0009583242936059833, 0.001939006382599473, 0.0016909617697820067, 0.0009346206788904965, 0.0004033645091112703, 0.0004982093814760447, 0.000322663108818233, 0.00046025021583773196, 0.0002339182246942073, 0.0002604362089186907, 0.00023104139836505055, 0.00022880265896674246, 0.00022658141097053885, 0.00021365621068980545, 0.00022347335470840335, 0.00025666668079793453, 0.00023893211618997157, 0.0002551444049458951, 0.00024403718998655677, 0.00024491859949193895] 
lowest training loss: 0.00021365621068980545  
last training loss: 0.00024491859949193895  
validation loss: [0.0890570804476738, 0.07226729393005371, 0.07573582977056503, 0.07331700623035431, 0.07586667686700821, 0.07219861447811127, 0.05866209790110588, 0.05359899252653122, 0.016335397958755493, 0.005840776022523642, 0.07185419648885727, 0.06031916290521622, 0.0356619693338871, 0.005198411177843809, 0.011341189965605736, 0.0027485203463584185, 0.013054746203124523, 0.003224356798455119, 0.006348004564642906, 0.004089239984750748, 0.004266203381121159, 0.00357127096503973, 0.0023416054900735617, 0.0015754440100863576, 0.0013702170690521598, 0.0011797785991802812, 0.001228660112246871, 0.0016874251887202263, 0.0014808744890615344, 0.001676730695180595] 
lowest validation loss: 0.0011797785991802812  
last validation loss: 0.001676730695180595  
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 30, 32)            4352      
_________________________________________________________________
dropout (Dropout)            (None, 30, 32)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 30, 32)            8320      
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 32)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 32)                8320      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 33        
=================================================================
Total params: 21,025
Trainable params: 21,025
Non-trainable params: 0
_________________________________________________________________
