single batch size: 30 
batch size: 32 
epochs: 30 
split point: 0.8 
training loss: [0.00038344008498825133, 0.001074323896318674, 0.0012689969735220075, 0.0015255991602316499, 0.0018824465805664659, 0.002029349794611335, 0.0022619962692260742, 0.002118632197380066, 0.0017003967659547925, 0.0009773023193702102, 0.0005562967271544039, 0.0005126495379954576, 0.0006363962311297655, 0.000445055979071185, 0.0010473093716427684, 0.00039204652421176434, 0.0002741035132203251, 0.00027058919658884406, 0.0003359172842465341, 0.00023587007308378816, 0.00021804618882015347, 0.00023434679314959794, 0.00025410621310584247, 0.00026650866493582726, 0.0002877851657103747, 0.00028756880783475935, 0.0003229279536753893, 0.0004035609890706837, 0.0003045711782760918, 0.00030038453405722976] 
lowest training loss: 0.00021804618882015347  
last training loss: 0.00030038453405722976  
validation loss: [0.07718977332115173, 0.07247225195169449, 0.0700395479798317, 0.07369069010019302, 0.06884054839611053, 0.07182305306196213, 0.07436808943748474, 0.045118872076272964, 0.0031649465672671795, 0.01518277544528246, 0.04878174141049385, 0.013341364450752735, 0.06256769597530365, 0.017511935904622078, 0.015996595844626427, 0.04329247400164604, 0.05316978320479393, 0.011206294409930706, 0.027754375711083412, 0.032532546669244766, 0.017135940492153168, 0.006387101951986551, 0.034969229251146317, 0.053315967321395874, 0.08573409169912338, 0.1284550577402115, 0.024896761402487755, 0.06860119849443436, 0.09329821914434433, 0.08718138933181763] 
lowest validation loss: 0.0031649465672671795  
last validation loss: 0.08718138933181763  
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 30, 56)            12992     
_________________________________________________________________
dropout (Dropout)            (None, 30, 56)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 30, 28)            9520      
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 28)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 14)                2408      
_________________________________________________________________
dropout_2 (Dropout)          (None, 14)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 15        
=================================================================
Total params: 24,935
Trainable params: 24,935
Non-trainable params: 0
_________________________________________________________________
