single batch size: 30 
batch size: 32 
epochs: 30 
split point: 0.8 
training loss: [0.02857453003525734, 0.024489616975188255, 0.029487304389476776, 0.03310064971446991, 0.02404317818582058, 0.01833353005349636, 0.016259070485830307, 0.01419371459633112, 0.014373451471328735, 0.014955660328269005, 0.015908241271972656, 0.012829231098294258, 0.012001702561974525, 0.01164370309561491, 0.010431421920657158, 0.011220394633710384, 0.011695564724504948, 0.010707316920161247, 0.010228365659713745, 0.01014026440680027, 0.010871514678001404, 0.009627331979572773, 0.008990747854113579, 0.008706276305019855, 0.008515615947544575, 0.008896010927855968, 0.008838833309710026, 0.008140345104038715, 0.008045723661780357, 0.007088950835168362] 
lowest training loss: 0.007088950835168362  
last training loss: 0.007088950835168362  
validation loss: [0.005766363814473152, 0.006915165111422539, 0.007055116351693869, 0.007695337757468224, 0.0020606922917068005, 0.0017931089969351888, 0.000738362839911133, 0.0011798685882240534, 0.0009348301100544631, 0.001199348596855998, 0.0011431722668930888, 0.0008231052779592574, 0.0008087484748102725, 0.0007532766321673989, 0.0006475321133621037, 0.0008841619128361344, 0.0008367039263248444, 0.0007363044423982501, 0.0008015314815565944, 0.0007101318915374577, 0.0010533740278333426, 0.0006738727679476142, 0.0007238891557790339, 0.0008575562969781458, 0.0007712433580309153, 0.0006597989704459906, 0.0006365429144352674, 0.000969343411270529, 0.0005983934388495982, 0.0007112632738426328] 
lowest validation loss: 0.0005983934388495982  
last validation loss: 0.0007112632738426328  
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 30, 32)            4352      
_________________________________________________________________
dropout (Dropout)            (None, 30, 32)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 8)                 1312      
_________________________________________________________________
dropout_1 (Dropout)          (None, 8)                 0         
_________________________________________________________________
dense (Dense)                (None, 1)                 9         
=================================================================
Total params: 5,673
Trainable params: 5,673
Non-trainable params: 0
_________________________________________________________________
